FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/LPC1756_SSP.c
    // Disable for the moment
    p->iICR = 0;

    // Set pins for use with SSP
    //    (*(aRequest->iCSGPIOPort))->Activate(
    //            aRequest->iCSGPIOPort,
    //            aRequest->iCSGPIOBit);

    // Set the CS as an output io pin
    (*(aRequest->iCSGPIOPort))->SetOutputMode(
            aRequest->iCSGPIOPort,
            aRequest->iCSGPIOBit);

    // Calculate the scr divider (rounding up to the next even number)
//    scr = (((((Fpclk/1000)+(aRequest->iRate-1))/(aRequest->iRate)))+1)&0xFFFE;
    scr = (((Fpclk/1000)+(aRequest->iRate-1))/(aRequest->iRate))-1;
    // Minimum of 2 divide factor
    if (scr < 2)
        scr = 2;

    // Make sure the SSP clock is PCLK/2
    p->iCPSR = 2;

    p->iICR0 =
        // Number of bits per transaction
        (aRequest->iBitsPerTransfer-1) |
        // SPI interface only
        SSP_FRF_SPI |
        // Clock out polarity
        (aRequest->iClockOutPolarity?SSP_CPOL:0) |
        (aRequest->iClockOutPhase?SSP_CPHA:0) |
        (scr << 8);

    // Enable the SSP
    p->iICR1 = SSP_SSE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_SSP_TransferPolled
 *---------------------------------------------------------------------------*/
/**
 *  Do a SSP transfer (both read and write) out the SSP port using
 *      the given request.
 *
 *  @param [in]    *aWorkspace      	Particular SSP workspace
 *
 *  @param [in]    *aRequest   			Request to perform
 *
 *  @return        T_uezError       	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_SSP_TransferPolled(void *aWorkspace, SPI_Request *aRequest)
{
    TUInt32 i;
    T_LPC1756_SSP_Workspace *aW = (T_LPC1756_SSP_Workspace *)aWorkspace;
    T_LPC1756_SSP_Registers *p = aW->iReg;
    TUInt8 *p_dataMISO8;
    TUInt8 *p_dataMOSI8;
    TUInt16 *p_dataMISO16;
    TUInt16 *p_dataMOSI16;

    // Setup SSP for this configuration
    ISSPConfig(aW, aRequest);

    // Start SSP
    ISSPStart(aRequest);

    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8)  {
        // Doing bytes
        p_dataMISO8 = (TUInt8 *)(aRequest->iDataMISO);
        p_dataMOSI8 = (TUInt8 *)(aRequest->iDataMOSI);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Wait for SSP to be no longer busy and transmit to be empty
            while ((p->iSR & SSP_BSY) || (!(p->iSR & SSP_TFE)))  {
                // TBD: Polling here instead of interrupt
            }

            // Send the SSP data (this also triggers a read in)
            if ((i+4)<=aRequest->iNumTransfers) {
                // Do 4 at one time
                p->iDR = (TUInt32) *(p_dataMOSI8++);
                p->iDR = (TUInt32) *(p_dataMOSI8++);
                p->iDR = (TUInt32) *(p_dataMOSI8++);
                p->iDR = (TUInt32) *(p_dataMOSI8++);
            } else {
                p->iDR = (TUInt32) *(p_dataMOSI8++);
            }

            // Wait until SSP done  (transmit empty)
            while ((p->iSR & SSP_BSY) || ((p->iSR & SSP_TFE)==0))  {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Store the SSP received over the data sent
            if ((i+4)<=aRequest->iNumTransfers) {
                // Do 4 at one time
                *(p_dataMISO8++) = p->iDR;
                *(p_dataMISO8++) = p->iDR;
                *(p_dataMISO8++) = p->iDR;
                *(p_dataMISO8++) = p->iDR;
                i+=3;
            } else {
                *(p_dataMISO8++) = p->iDR;
            }
        }
    } else {
        // Doing words
        p_dataMISO16 = (TUInt16 *)(aRequest->iDataMISO);
        p_dataMOSI16 = (TUInt16 *)(aRequest->iDataMOSI);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Wait for SSP to be no longer busy and transmit to be empty
            while ((p->iSR & SSP_BSY) || (!(p->iSR & SSP_TFE)))  {
                // TBD: Polling here instead of interrupt
            }

            // Send the SSP data (this also triggers a read in)
            p->iDR = (TUInt32) *(p_dataMOSI16++);

            // Wait until SSP done
            while ((p->iSR & SSP_BSY) || ((p->iSR & SSP_TFE)==0))  {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Store the SSP received over the data sent
            *(p_dataMISO16++) = p->iDR;
        }
    }
    // End SSP
    ISSPEnd(aRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_SSP_SSP0_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 SSP0 workspace.
 *
 *  @param [in]    *aWorkspace  	Particular SSP workspace
 *
 *  @return        T_uezError     	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_SSP_SSP0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_SSP_Workspace *p = (T_LPC1756_SSP_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_SSP_Registers *)SSP0_BASE;

    G_SSP0Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = SSP0_IRQn;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1756_SSP_SSP1_InitializeWorkspace
 *---------------------------------------------------------------------------*/
/**
 *  Setup the LPC1756 SSP1 workspace.
 *
 *  @param [in]    *aWorkspace       	Particular SSP workspace
 *
 *  @return        T_uezError          	Error code
 *  @par Example Code:
 *  @code
 *  #include <uEZ.h>
 *  
 *  TODO
 *  @endcode
 */
/*---------------------------------------------------------------------------*/
T_uezError LPC1756_SSP_SSP1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1756_SSP_Workspace *p = (T_LPC1756_SSP_Workspace *)aWorkspace;
    p->iReg = (T_LPC1756_SSP_Registers *)SSP1_BASE;

    G_SSP1Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = SSP1_IRQn;

    return UEZ_ERROR_NONE;
}








/*---------------------------------------------------------------------------*
 * Routine: ISSPxIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the SSPx interrupts and forward to ISSPProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISSP0IRQ )
{
    IRQ_START();
    ISSPProcessInterrupt(G_SSP0Workspace);
    IRQ_END();
}

IRQ_ROUTINE( ISSP1IRQ )
{
    IRQ_START();
    ISSPProcessInterrupt(G_SSP1Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine: ISSPProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the SSP interrupts.
 *      NOTE: This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SerialPortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void ISSPProcessInterrupt(T_LPC1756_SSP_Workspace *aW)
{
    T_LPC1756_SSP_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt8 ris;
    TUInt32 data;

    while (1) {
        // Do we have any interrupts to process now?
        ris = p->iMIS;
        if (!ris)
            break;

        // Is data waiting to be received?
        if (ris & (SSP_RTMIS | SSP_RXMIS)) {
            // Pull the data out of the SSP peripheral
            if (r->iNumTransferredIn < r->iNumTransfers) {
                data = p->iDR;
                if (r->iDataMISO)
                    ((TUInt8 *)r->iDataMISO)[r->iNumTransferredIn++] = data;
            }

            // If we have reached the end, we are done
            if (r->iNumTransferredIn >= r->iNumTransfers) {
                // No more processing.  Stop here.
                InterruptDisable(aW->iIRQChannel);

